app/views/issues/show.html.erb

SELECT `solutions`.* FROM `solutions` WHERE `solutions`.`issue_id` = 2
---
  <div class="panel-body">
    <% if @issue.solutions.present? %>