app/views/shared/_filter.html.erb

          <%= label_tag(:category_id, "Category", class: "control-label") %>
          <%= select_tag "category", options_from_collection_for_select(Category.all, "id", "name"), class: "form-control", :prompt => 'Select' %>
---
SELECT `categories`.* FROM `categories`

          <%= label_tag(:language_id, "Language", class: "control-label") %>
          <%= select_tag "language", options_from_collection_for_select(Language.all, "id", "name"), class: "form-control", :prompt => 'Select' %>
---
SELECT `languages`.* FROM `languages`