app/controllers/issues_controller.rb

  def index
    @issues = Issue.all
    @credentials = Credential.all
    @requirements = Requirement.all
---
SELECT `issues`.* FROM `issues`
SELECT `credentials`.* FROM `credentials`
SELECT `requirements`.* FROM `requirements`

  def new
    @issue = Issue.new
    respond_to do |format|
      format.json {
        render json: {languages: Language.all, categories: Category.all}
---
SELECT `categories`.* FROM `categories`
SELECT `languages`.* FROM `languages`

  def create
    @issue = Issue.create(issue_params)
---
INSERT INTO `issues` (`category_id`, `language_id`, `title`, `created_at`, `updated_at`) VALUES (1, 1, 'test', '2015-10-03 07:21:17', '2015-10-03 07:21:17')

  def show
    @issue = Issue.find_by_id(params[:id])
---
SELECT  `issues`.* FROM `issues` WHERE `issues`.`id` = 2 LIMIT 1

  def issue_search
    @issues = Issue.where(:category_id => params["category"], :language_id => params["language"])
---
SELECT `issues`.* FROM `issues` WHERE `issues`.`category_id` IS NULL AND `issues`.`language_id` IS NULL