app/controllers/solutions_controller.rb

SELECT  `issues`.* FROM `issues` WHERE `issues`.`id` = 2 LIMIT 1
INSERT INTO `solutions` (`description`, `issue_id`, `created_at`, `updated_at`) VALUES ('gdsfg dsfg dsf', 1, '2015-10-10 18:36:18', '2015-10-10 18:36:18')
---
  def create
    issue = Issue.find_by_id(params[:issue_id])
    solution = issue.solutions.build(solution_params)
    respond_to do |format|
      if solution.save